RIET/src/Catalogs/UsersPODsEMailTemplates/UsersPODsEMailTemplates.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>UsersPODsEMailTemplates</name>
  <owners>Catalog.Пользователи</owners>
  <attributes>
    <name>POD</name>
    <type>
      <types>CatalogRef.CountriesHUBs</types>
    </type>
  </attributes>
  <attributes>
    <name>ConsignTo</name>
    <type>
      <types>CatalogRef.ConsignTo</types>
    </type>
  </attributes>
  <attributes>
    <name>Subject</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Body</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

RIET/src/Catalogs/UsersPODsEMailTemplates/ObjectModule.bsl
///////////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ СПРАВОЧНИКА

// ОБРАБОТКА ЗАПОЛНЕНИЯ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения)
	
	Если НЕ ЗначениеЗаполнено(Владелец) Тогда
		Владелец = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли; 
	
КонецПроцедуры 

// ПЕРЕД ЗАПИСЬЮ

Процедура ПередЗаписью(Отказ)
	
	РГСофтКлиентСервер.УстановитьЗначение(Код, СокрЛП(Код));
	РГСофтКлиентСервер.УстановитьЗначение(Subject, СокрЛП(Subject));
	РГСофтКлиентСервер.УстановитьЗначение(Body, СокрЛП(Body));
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьЗаполнениеРеквизитов(Отказ);
	
КонецПроцедуры

Процедура ПроверитьЗаполнениеРеквизитов(Отказ)
	
	Если ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СокрЛП(Код)) Тогда	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Поле ""Name"" не заполнено!",
			ЭтотОбъект, "Код", , Отказ);	
	КонецЕсли;
		
	Если НЕ ЗначениеЗаполнено(Владелец) Тогда	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Поле ""User"" не заполнено!",
			ЭтотОбъект, "Владелец", , Отказ);	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(POD) Тогда	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Поле ""POD"" не заполнено!",
			ЭтотОбъект, "POD", , Отказ);	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ConsignTo) Тогда	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Поле ""Consign-to"" не заполнено!",
			ЭтотОбъект, "ConsignTo", , Отказ);	
	КонецЕсли;
	
КонецПроцедуры
